In [49]:
import pandas as pd

df = pd.read_json('file.json', orient='columns', lines=True)

df.head()

   age    first  gender      last  latitude  longitude
0   45     tony    male  armstron    7.6876  -138.0943
1   35    kelly    male   griffin  -82.5088    -8.7742
2   33    milly  female   selstad   49.4328    20.6618
3   32    delia  female    fleury  -57.2241    38.1720
4   41  lucille  female   simmons  -86.4193   154.9268

### 1) Which percentage of users are male vs female ??

In [20]:
#df.groupby('gender').count()
(df['gender'].value_counts()/df['gender'].count())*100

female    50.033553
male      49.966447
Name: gender, dtype: float64

### 2) What are the ages of most of the users ??

In [31]:
df.groupby('age').count().sort_values('first',ascending=False).head()

     first  gender  last  latitude  longitude
age
38     322     322   322       322        322
50     313     313   313       313        313
28     309     309   309       309        309
67     307     307   307       307        307
29     300     300   300       300        300

### 3) Of the users how many are in their 20s, 30s, 40s etc.. ??

In [45]:
df.loc[(df['age'] >= 20) & (df['age'] < 30)].count()

age          2567
first        2567
gender       2567
last         2567
latitude     2567
longitude    2567
dtype: int64

In [46]:
df.loc[(df['age'] >= 30) & (df['age'] < 40)].count()

age          2807
first        2807
gender       2807
last         2807
latitude     2807
longitude    2807
dtype: int64

In [47]:
df.loc[(df['age'] >= 40) & (df['age'] < 50)].count()

age          2755
first        2755
gender       2755
last         2755
latitude     2755
longitude    2755
dtype: int64

### 4) Save the file as csv ??

In [56]:
#df.to_csv('file.csv',index_label='id')
df.to_csv('file.csv',index=False)

### 5) Map male=>1, female=>0

In [60]:
df['gender'].map({'male': '1', 'female': '0'})

0        1
1        1
2        0
3        0
4        0
5        1
6        1
7        0
8        1
9        1
10       1
11       0
12       0
13       0
14       0
15       1
16       0
17       1
18       0
19       1
20       1
21       0
22       0
23       1
24       1
25       0
26       0
27       0
28       1
29       0
        ..
14872    0
14873    0
14874    1
14875    0
14876    0
14877    1
14878    1
14879    0
14880    1
14881    0
14882    0
14883    1
14884    1
14885    1
14886    1
14887    1
14888    0
14889    0
14890    0
14891    1
14892    0
14893    1
14894    0
14895    0
14896    0
14897    0
14898    1
14899    0
14900    0
14901    1
Name: gender, Length: 14902, dtype: object